#include <iostream>

using namespace std;

int main () {
	
	setlocale(0, "Russian");
	
	int num_day, num_month;
	
	string months[] = {
		"Января", "Февраля", "Марта", "Апреля", "Мая", "Июня", "Июля", "Августа", "Сентября", "Октября", "Ноября", "Декабря"
	};
	
	string days[] = {
		"Первое", "Второе", "Третье", "Четвертое", "Пятое", "Шестое", "Седьмое", "Восьмое", "Девятое", "Десятое",
		"Одиннадцатое", "Двенадцатое", "Тринадцатое", "Четырнадцатое", "Пятнадцатое", "Шестнадцатое", "Семнадцатое", "Восемнадцатое", "Девятнадцатое", "Двадцатое",
		"Двадцать первое", "Двадцать второе", "Двадцать третье", "Двадцать четвертое", "Двадцать пятое", "Двадцать шестое", "Двадцать седьмое", "Двадцать восьмое", 
		"Двадцать девятое", 
		"Тридцатое", "Тридцать первое"
	};
	
	cout << "Введите номер дня от 1 до 31: ";
	cin >> num_day;
	
	cout << "Введите номер месяца от 1 до 12: ";
	cin >> num_month;
	
	cout << days[num_day - 1] << " " << months[num_month - 1];
	
}
